Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །ངོ་མཚར་སྙམ་པའི་སེམས་བསྐྱེད་ནས། །གུས་པས་ཀུན་ལ་སྦྱིན་པ་བཏང་།
en: “Since I did not distinguish between high and low

source: །ང་སྔོན་སྦྱིན་པ་གཏོང་བའི་ཚེ། །སེམས་ལ་མཐོ་དམའ་མེད་པས་ན།
en: When I was practicing generosity in the past, I dedicated myself one pointedly to this discourse

source: །སྡུག་བསྔལ་འགྲོ་བ་མི་ཚོལ་ཞིང་། །མདོ་སྡེ་འདི་ལ་རྩེ་གཅིག་མོས།
en: Without pursuing afflicted states.

source: །རེས་འགའ་ཡུལ་ཁམས་དག་ཏུ་ནི།
en: “At times, in some lands,

source: །ཕྱིར་རྒོལ་ཐམས་ཅད་མེད་བྱས་ཤིང་།
en: I annihilated all opposing forces

source: །ཀླུ་རྣམས་ཀུན་ནི་རབ་བཏུལ་ནས།
en: And subjugated all the nāgas

source: །དུས་བཞིན་ཆར་ནི་རབ་ཏུ་ཕབ།
en: So that they showered rains in timely ways.

source: །ཟླ་འོད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས།
en: “Candraprabha, you should know that, in the pursuit of this discourse,

source: །ངས་ནི་ཚེ་རབས་དཔག་མེད་ནས། །མདོ་སྡེ་འདི་ནི་གཉེར་བའི་ཕྱིར། །དཀའ་བ་རྣམས་ནི་རབ་ཏུ་སྤྱད།
en: I have undergone austerities for countless lifetimes;

source: །བསྐལ་པ་བརྒྱ་སྟོང་སྙེད་དུ་ནི།
en: Even if these were described for a hundred thousand eons,

source: །བརྗོད་ཀྱང་མཐར་ཐུག་མི་འགྱུར་རོ།
en: This task would never come to an end.

source: །ཡིད་ཆེས་པ་ལ་ཁྱོད་གནས་ནས།
en: “Abide by such a conviction and,

source: །མ་འོངས་ཐ་མ་དུས་ཀྱི་ཚེ།
en: In the future, during the final period,

source: །ཡང་དག་དྲན་པའི་སེམས་སྐྱེད་ལ།
en: Give rise to genuine recollection

source: །མདོ་སྡེ་འདི་ནི་བཤད་པར་གྱིས། །ངས་ནི་སངས་རྒྱས་སྤྱན་དག་གིས།
en: And expound this discourse!

source: །མ་འོངས་དུས་ནི་གསལ་གཟིགས་པས།
en: “I clearly see the future With my buddha eyes;

source: །སྤྱོད་པ་སྣ་ཚོགས་ཇི་ལྟ་བ། །ཐམས་ཅད་རབ་ཏུ་མཁྱེན་པ་ཡིན།
en: I know precisely all the various actions

source: །དགེ་སློང་དག་ནི་གང་ཞིག་གིས།
en: That will occur. “I also know all the monks who,

source: །བླ་མེད་ཡེ་ཤེས་བཙལ་བའི་ཕྱིར།
en: In the pursuit of unsurpassed wisdom,

source: །ཤིན་ཏུ་དང་བའི་སེམས་ཀྱིས་ནི།
en: Will teach this discourse with minds filled with faith,

source: །མདོ་སྡེ་འདི་ནི་གང་སྟོན་པ།
en: As well as all the directions in which this teaching will take place.

source: །གང་ཟག་དེ་དང་ཕྱོགས་རྣམས་ཀྱང་། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད།
en: “I also know all the thoughts and methods of those who,

source: །མདོ་འདི་ཐོས་ནས་གང་མོས་པ།
en: Will be interested in this discourse

source: །བསམ་པ་དང་ནི་ཐབས་རྣམས་ཀྱང་།
en: Upon hearing it.

source: །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །དམན་པ་དག་ནི་གང་ཞིག་གིས།
en: “I know all the inferior beings

source: །མདོ་སྡེ་འདི་ནི་མ་ཐོས་པས།
en: Who will not hear this discourse And who will therefore denigrate

source: །ཆོས་བསྟན་པ་ལ་སྐུར་འདེབས་པ། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད།
en: The teachings of the Dharma.

source: །དགེ་སློང་རྣམས་ནི་གང་ཞིག་དང་། །དགེ་སློང་མ་ནི་གང་ཞིག་གིས། །མདོ་སྡེ་འདི་ནི་ཐོས་གྱུར་ནས།
en: “I will give a prophecy to all the monks and nuns

source: །ཤིན་ཏུ་གདུང་བས་ངུ་བྱེད་པ།
en: Who cry out of heartfelt longing

source: །དེ་ཀུན་ངས་ནི་ལུང་བསྟན་ནས།
en: When they hear this discourse,

source: །རྒྱལ་བ་གཙོ་བོ་མཐོང་བར་འགྱུར།
en: And they will behold the supreme victors.

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི།
en: Through my awakened miraculous power,

source: །གང་དག་ཡིད་ནི་དག་པ་དང་། །གང་དག་གི་ནི་མ་དག་དང་། །ཐ་ན་མོས་པ་གང་ཡིན་པ།
en: I know the purity and the impurity of beings’ minds,

source: །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད།
en: And even all their inclinations.

source: །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས།
en: “I know all the qualities of sentient beings,

source: །རབ་ཞི་དབེན་ལ་རྟག་མོས་ཤིང་།
en: Such as those who are always dedicated to peace and isolation,

source: །ཏིང་འཛིན་རྣམས་ལ་རབ་གནས་ནས། །འཁོར་བ་དག་ལ་མ་ཆགས་པས།
en: Dwell in absorptions without any attachment to saṃsāra,

source: །ཐ་ན་བག་ཆགས་རྣམས་ཀྱང་ནི། །གཏན་ནས་རབ་ཏུ་གང་སྤངས་དང་། །དེ་ལ་སོགས་པའི་ཡོན་ཏན་རྣམས། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད།
en: And have permanently abandoned even its habitual patterns.

source: །མི་བདེན་ཆོས་ལ་ཞེན་པ་དང་། །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས།
en: Adhere to untrue teachings, And which ones

source: །སངས་རྒྱས་ལ་ནི་རབ་མོས་པ། །མ་འོངས་དངོས་པོ་འདི་ལྟ་བུ། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས།
en: Will be devoted to the Buddha.

source: །འཇིག་རྟེན་བདེ་ལ་རབ་ཆགས་པས།
en: “Beings who are attached to worldly pleasures

source: །སངས་རྒྱས་བྱང་ཆུབ་ས་བོན་དག །ལེགས་པ་ཉིད་དུ་མི་སྐྱེད་པ།
en: Will not properly grow the seed of the buddhas’ awakening;

source: །རྒྱུ་དང་རྐྱེན་ནི་དེ་ཡི་ཕྱིར།
en: Due to such causes and conditions,

source: །སྦྱོར་བ་རྣམས་ནི་ཉམས་པར་འགྱུར། །སུ་ཡང་རུང་བ་གང་ཞིག་གིས།
en: Their practices will deteriorate.

source: །བྱང་ཆུབ་ས་བོན་རྟོགས་གྱུར་ན།
en: “Candraprabha, those who realize the seed of awakening

source: །གང་ཟག་དེ་ཡིས་ངེས་པར་ནི། །རྣམ་དག་འོད་ཟེར་དཔག་མེད་ཐོབ། །ཟླ་འོད་ཁྱོད་ཀྱིས་འདི་ལྟ་བུར།
en: Are certain to obtain pure, boundless lights.

source: །འོད་ཟེར་འདི་ལ་སོགས་པ་ཡི། །རྒྱུ་དང་རྐྱེན་ནི་རེ་རེ་ཀུན། །སོ་སོ་ཐ་དད་ཉིད་དུ་ལྟོས།
en: Thus, regard each of the causes and conditions related to such lights distinctly;

source: །ཁྱོད་ཀྱིས་ཤེས་རབ་སྟོབས་ཀྱིས་ནི། །ཐམས་ཅད་དེ་ལྟར་རིག་པར་གྱིས།
en: You should perceive them all through the power of insight.

source: །གང་ཞིག་མི་དགེ་གྲོགས་སྤངས་ཏེ།
en: “Those who abandon unwholesome friends,

source: །དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་བྱས།
en: Who rely on virtuous friends,

source: །ཚུལ་ཁྲིམས་རྣམ་དག་གང་སྲུང་བ།
en: And who guard the purity of their discipline

source: །སངས་རྒྱས་འོད་ཟེར་སྒྲུབ་པར་འགྱུར།
en: Will accomplish the lights of the buddhas.

source: །ཁྱོད་ཀྱིས་དབང་པོ་རབ་སྲུངས་ལ།
en: “Guard your senses,

source: །ངོ་ཚ་ཁྲེལ་མེད་རབ་ཏུ་སྤོངས།
en: Abandon shamelessness and indecency,

source: །དགེ་བའི་ཆོས་ནི་རབ་བསྒོམས་ལ།
en: Cultivate virtuous qualities,

source: །སེམས་ཅན་རྣམས་ནི་བསྲུང་བར་གྱིས།
en: And protect sentient beings!

source: །ཁྱོད་ཀྱིས་རྩོད་པ་རབ་སྤོངས་ལ།
en: “Stop being involved in conflicts,

source: །སྟོང་ཉིད་དག་ནི་རྟོགས་པར་གྱིས། །རྙེད་པ་དག་ལ་མ་གདུ་བར།
en: Realize emptiness,

source: །མང་ཐོས་ལེགས་བཤད་ལྡན་པར་གྱིས།
en: And develop erudition and eloquence

source: །ཁྱོད་ཀྱིས་རྙེད་པ་དག་ལ་ནི།
en: Without hankering for personal gain!

source: །མི་གཙང་ལྟ་བུར་བལྟ་བར་གྱིས། །རྙེད་པའི་དྲི་མ་དག་གིས་ནི།
en: “Regard all personal achievements as being like fecal filth

source: །རྣམ་དག་སེམས་ནི་སྦགས་མ་བྱེད།
en: And do not let the purity of your mind Be defiled by the stains of selfish gains;

source: །རྣམ་པར་གྲོལ་བ་བཙལ་བར་བྱོས། །བླ་མེད་རྙེད་པ་ཐོབ་པར་འགྱུར།
en: Pursue liberation and you will achieve the unsurpassed goal!

source: །ཁྱོད་ཀྱིས་སངས་རྒྱས་ལམ་བསྒྲུབས་ལ།
en: “Accomplish the path of the buddhas,

source: །སངས་རྒྱས་ཆོས་ཉིད་འདྲ་བར་ལྟོས།
en: Regard the Buddha and reality as being similar,

source: །ཆོས་ཀྱི་སྒྲོན་ཆེན་རྟག་སྦོར་ལ།
en: Always set ablaze the great torch of the Dharma,

source: །འཇིག་རྟེན་ཀུན་ནི་སྣང་བར་གྱིས།
en: And illuminate all the worlds!

source: །ཁྱོད་ཀྱི་སེམས་ནི་རི་རྒྱལ་ལྟར།
en: “Let your mind be unshakable Like the king of mountains,

source: །མི་གཡོ་ཉིད་དུ་རབ་ཏུ་བྱོས།
en: And eagerly cultivate patience toward everyone,

source: །ཁ་ངན་དང་ནི་བརྡེགས་པ་ཡང་།
en: Even when you are insulted or beaten!

source: །ཐམས་ཅད་བཟོད་པ་དང་དུ་ལོང་།
en: “Act as a genuine virtuous friend

source: །ཁྱོད་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར། །དགེ་བཤེས་ཡང་དག་རབ་ཏུ་བྱོས།
en: For the sake of sentient beings,

source: །དམན་པའི་སེམས་ནི་ཡོངས་སྤོངས་ལ།
en: Abandon all forms of inferior attitude,

source: །རྣམ་དག་ལས་ནི་རྟག་ཏུ་སྒྲུབས།
en: And always accomplish pure actions!

source: །ཁྱོད་ཀྱི་སེམས་ནི་བརྟན་བྱོས་ལ།
en: “Let your mind be stable,

source: །བླ་མེད་ཆོས་ནི་རབ་ཏུ་སྟོན།
en: Teach the unsurpassed Dharma,

source: །མདོ་སྡེ་དམ་པ་འདི་ལྟ་བུ།
en: And bestow this sacred discourse

source: །བརྩེ་བ་ཅན་ལ་སྦྱིན་པར་གྱིས།
en: On the kindhearted!

source: །བླ་མེད་ཡེ་ཤེས་གང་ཚོལ་བ།
en: “Those who pursue unsurpassed wisdom

source: །འཁོར་བ་དག་ལ་འཇིགས་མ་བྱེད།
en: Are not afraid of saṃsāra;

source: །དེས་ནི་སྡིག་པ་རྣམ་སྤངས་ནས།
en: Having abandoned negative deeds,

source: །ཕན་ཡོན་མཆོག་ནི་ཐོབ་པར་འགྱུར།
en: They will gain the most supreme benefits. “As an analogy, Candraprabha, you should know

source: །དཔེར་ན་བློ་དང་ལྡན་པ་དག །མེ་ལ་སྤྱོད་པར་མཁས་པ་གང་།
en: That experts can skillfully handle fire,

source: །རོ་རྣམས་སྣ་ཚོགས་སྦྱིན་བྱེད་ཀྱང་། །མེས་ནི་སྲེག་པར་ཡོང་མི་འགྱུར། །གང་ཞིག་བློ་དང་མི་ལྡན་པ།
en: To produce various flavors without being burned,

source: །ཐབས་དག་ལ་ནི་མི་མཁས་པས། །མེ་ཁྱེར་ལག་མཐིལ་གང་བཞག་པ། །མེས་ནི་རབ་ཏུ་སྲེག་པར་འགྱུར།
en: While unskilled dilettantes burn their palms when handling fire. “Moreover, the disturbed and crazed mind

source: །ཇི་ལྟར་མི་ཞིག་དུག་དག་གིས། །སེམས་ནི་འཁྲུགས་ནས་མྱོས་པ་གང་།
en: Of someone who has been poisoned

source: །མེ་ལ་རབ་ཏུ་བསྲོས་ན་ནི། །དེ་ཡི་རྒྱུ་ཡིས་སོས་པར་འགྱུར། །ཟླ་འོད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས།
en: Can be cured by the heat of fire.

source: །བློ་དང་ལྡན་པའང་དེ་བཞིན་དུ།
en: It is similar for the wise:

source: །ཡིད་བརྟེན་ཡིད་ནི་སྟོང་པར་རིག །དེ་ཕྱིར་འཁོར་བར་གནས་ཀྱང་ནི།
en: “Based on the mind, they see that the mind is empty. Therefore, although they abide within saṃsāra,

source: །མིག་བརྟེན་མིག་ནི་སྟོང་རིག་པས།
en: They see—based on the eye—that the eye is empty,

source: །མིག་ལ་མངོན་པར་ཞེན་པ་མེད།
en: And so they do not cling to the eye.

source: །གལ་ཏེ་དེ་ལྟར་རབ་ཤེས་ན།
en: “Those who understand in that way

source: །མིག་ལ་གནས་ཀྱང་ཉོན་མོངས་མེད།
en: Can dwell on the eyes without causing affliction;

source: །གལ་ཏེ་མིག་ཉིད་སྟོང་རིག་ན། །ཡང་དག་ཡེ་ཤེས་སྒྲུབ་པར་འགྱུར། །ཡང་དག་ཡེ་ཤེས་ཐོབ་པའི་ཕྱིར།
en: If they see that the eye is empty, they will achieve genuine wisdom,

source: །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར།
en: And light rays will therefore manifest.

source: །གལ་ཏེ་མིག་ཉིད་སྟོང་རིག་ན།
en: “If they see that the eye is empty,

source: །འདོད་ཆགས་དག་ནི་གཏན་ནས་སྤོང་།
en: They will permanently abandon desire.

source: །འདོད་ཆགས་དག་ནི་མེད་པའི་ཕྱིར།
en: Due to this absence of desire,

source: །དེ་བཞིན་ཞེ་སྡང་གཏི་མུག་དང་། །ངར་འཛིན་འཆབ་དང་ཁྲོ་བ་དང་། །སེར་སྣ་ཕྲག་དོག་ངོ་ཚ་མེད།
en: Aggression, miserliness, envy, “Shamelessness, impatience,

source: །མི་བཟོད་སེམས་ནི་མཐོ་བ་དང་། །རྒྱགས་དང་མངོན་པའི་ང་རྒྱལ་དང་། །གཡོ་སྒྱུ་དང་ནི་བག་མེད་དང་། །གྱ་གྱུ་ལ་སོགས་བར་དུ་ཡང་། །ཐམས་ཅད་འདོད་ཆགས་བཞིན་དུ་བཤད།
en: Haughtiness, arrogance, Pride, deceit, Carelessness, dishonesty, and so forth.

source: །ཡང་དག་ཡེ་ཤེས་ཐོབ་གྱུར་ན།
en: “Those who obtain genuine wisdom

source: །མིག་ནི་ཞི་བ་ཉིད་དུ་རྟོགས། །ཞི་བ་ཉིད་དུ་རྟོགས་པའི་ཕྱིར།
en: Realize the eye to be peace.

source: །སངས་རྒྱས་ཚུལ་ལ་རབ་ཏུ་གནས། །ཚུལ་ལ་རབ་ཏུ་གནས་པའི་ཕྱིར།
en: Are settled in the way of the buddhas,

source: །སངས་རྒྱས་ཐབས་ལ་གནས་པར་འགྱུར། །ཐབས་ལ་རབ་ཏུ་གནས་པའི་ཕྱིར།
en: Are settled in the methods of the buddhas,

source: །ཡང་དག་ཡེ་ཤེས་མ་བསྒྲུབས་པར།
en: “I have never heard of or seen

source: །སྒྲིབ་པ་དག་ནི་གཏན་སྤོང་ཞིང་།
en: Anyone who has permanently abandoned the obscurations

source: །འོད་ཟེར་འབྱུང་བ་སྒྲུབ་པར་ནི།
en: And accomplished the manifestation of light rays

source: །ངས་སྔོན་མ་ཐོས་མ་མཐོང་ངོ་།
en: Without achieving genuine wisdom.

source: །ཡང་དག་ཡེ་ཤེས་རབ་བསྒྲུབས་ནས།
en: “Those who, after realizing genuine wisdom,

source: །སྒྲིབ་པའི་གནོད་པ་གཏན་སྤོང་ཞིང་།
en: Permanently rid themselves of the harm of the obscurations

source: །སྤྱོད་པ་འདི་རྗེས་གང་འབྲང་བ།
en: And observe this conduct

source: །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར།
en: Will achieve the emanation of light rays.

source: །རྒྱལ་བའི་སྤྱོད་པ་ཡོངས་ཚོལ་ཞིང་། །མདོ་སྡེ་འདི་ལ་བསླབས་བྱས་ནས།
en: “Those who pursue the conduct of the victors

source: །དེ་བཞིན་གཤེགས་ལ་གང་མཆོད་པ།
en: And worship the thus-gone ones After having trained in this discourse

source: །ཡང་དག་ཡེ་ཤེས་ཐབས་ཐོབ་འགྱུར།
en: Will achieve genuine wisdom and skillful means.

source: །ཡང་དག་ཡེ་ཤེས་གང་བསྒྲུབས་པ།
en: “Those who have achieved genuine wisdom

source: །སངས་རྒྱས་རྣམས་ལ་མཆོད་པར་གྱིས།
en: Should worship the buddhas

source: །འོད་ཟེར་འགྱེད་པ་རྫོགས་པར་འགྱུར།
en: To perfect the emanation of light rays

source: །ལག་མཐིལ་འབྲས་བུ་ཇི་བཞིན་ནོ།
en: Like fruits in the palms of their hands. “For those who are deluded

source: །མིག་ལ་བདག་མེད་གང་རྨོངས་པ།
en: About the selflessness of the eye,

source: །དགེ་སྦྱོང་ཆོས་ནི་ཉམས་པར་འགྱུར།
en: The qualities of spiritual training will decline;

source: །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར།
en: Those persons will not achieve the emanation of light rays. “It is those who realize

source: །མིག་ལ་བདག་མེད་གང་རྟོགས་པ།
en: The selflessness of the eye

source: །དགེ་སློང་ཆོས་ནི་སྒྲུབ་པར་འགྱུར།
en: Who accomplish the qualities of virtuous practice;

source: །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར།
en: Such persons will achieve the emanation of light rays.

source: །མིག་གི་མཐའ་ཟད་གང་རྟོགས་པ།
en: “Those who realize the limit of the exhaustion of the eye

source: །རྣ་བ་སྐྱེ་བའི་མཐའ་ཡང་རྟོགས།
en: Will also realize the limit of the arising of the ear.

source: །རྣ་བ་སྐྱེ་བའི་མཐའ་རྟོགས་པས།
en: Realizing the limit of the arising of the ear

source: །དགེ་སྦྱོང་ཆེན་པོའི་ཆོས་ཤེས་བྱ།
en: Is known as the quality of great virtuous practice.

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ཡོངས་སུ་མ་ཤེས་ན།
en: “Those who do not understand the limit of the eye’s natural state

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ཡོངས་སུ་ཤེས་པར་མི་འགྱུར་བས།
en: Will also not understand the limit of the arising of the eye;

source: །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི།
en: Those persons will therefore

source: །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར།
en: Not achieve the emanation of light rays.

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ཡོངས་སུ་ཤེས་གྱུར་ན།
en: “Those who understand the ultimate essence of the eye

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ཡོངས་སུ་ཤེས་པ་ཉིད་དུ་འགྱུར།
en: Will also understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་མ་ཤེས་ན།
en: “Those who do not properly understand the limit of the eye’s natural state

source: །མིག་གི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ལེགས་པ་ཉིད་དུ་མི་ཤེས་པས།
en: Will also not properly understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད།
en: “Those who properly understand the limit of the eye’s natural state

source: །མཐའ་ནི་ལེགས་པར་ཤེས་གྱུར་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ལེགས་པ་ཉིད་དུ་ཤེས་འགྱུར་བས།
en: Will also properly understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་མངོན་སུམ་མ་ཤེས་ན།
en: “Those who do not directly understand the limit of the eye’s natural state

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །མངོན་སུམ་ཉིད་དུ་མི་ཤེས་པས།
en: Will also not directly understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་མངོན་སུམ་ཤེས་གྱུར་ན།
en: “Those who directly understand the limit of the eye’s natural state

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །མངོན་སུམ་ཉིད་དུ་རབ་ཤེས་པས།
en: Will also directly understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་ཤེས་གྱུར་ན།
en: “Those who properly understand the limit of the eye’s natural state

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །མངོན་སུམ་ཉིད་དུ་ཤེས་འགྱུར་བས།
en: Will also directly understand the limit of the arising of the eye;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །རྣམ་དག་ལེགས་པར་མ་ཤེས་ན།
en: “Those who do not properly understand the purity of the eye’s natural state

source: །རྣ་བའི་ངོ་བོ་རྣམ་དག་པ། །ལེགས་པ་ཉིད་དུ་མི་ཤེས་པས།
en: Will not properly understand the purity of the ear’s natural state;

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །རྣམ་དག་ལེགས་པར་ཤེས་གྱུར་ན།
en: “Those who properly understand the purity of the eye’s natural state

source: །རྣ་བའི་ངོ་བོ་རྣམ་དག་པ། །ལེགས་པ་ཉིད་དུ་རྟོགས་འགྱུར་བས།
en: Will properly realize the purity of the ear’s natural state;

source: །དེ་བཞིན་སྣ་དང་ལྕེ་དང་ལུས།
en: To the nose, the tongue, the body, the mind,

source: །ཡིད་དང་གཟུགས་སྒྲ་དྲི་རོ་དང་། །རེག་བྱ་ཆོས་དང་ས་ཆུ་དང་། །མེ་རླུང་དག་གི་དངོས་པོ་དང་། །འཇིག་རྟེན་སྡུག་བསྔལ་ཕུང་པོ་དང་། །ཁམས་དང་འཇིག་རྟེན་སྐྱེ་མཆེད་དང་། །སྒྲ་དང་མིང་ལ་སོགས་པ་ཡང་།
en: Forms, sounds, scents, tastes, Textures, and mental phenomena. “It also applies to the elements of earth, water, fire, and air, The world, suffering, The aggregates, elements, mundane sense sources,

source: །ཐམས་ཅད་དེ་བཞིན་རིག་པར་གྱིས།
en: Words, names, and so forth.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་སེམས་ཅན་གང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་ཞིང་འོད་ཟེར་འགྱེད་པ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དེས་དགེ་བའི་རྩ་བའི་ཚོགས་རྣམ་པ་བརྒྱད་ཅུ་པོ་འདི་དག་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །རྣམ་པ་བརྒྱད་ཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Then the Blessed One said to Candraprabhakumārabhūta, “Noble son, sentient beings dedicated to the Great Vehicle who wish to perfect this emanation of light rays must accomplish eighty types of accumulation of roots of virtue.

source: སེམས་ཅན་ཡོངས་སུ་སྲུང་ཞིང་རྗེས་སུ་དྲན་པ་དང་། གནོད་སེམས་མེད་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་སྲུང་ཞིང་ཉམས་པར་མི་བྱེད་པ་དང་། སེམས་ཤིན་ཏུ་མཉམ་པ་དང་། གཡོ་སྒྱུ་མེད་པ་དང་། སེར་སྣ་མེད་པ་དང་། ཕྲག་དོག་མེད་པ་དང་། འདོད་ཆགས་ཀྱི་བསམ་པ་མེད་པ་དང་། བསླུ་བའི་བསམ་པ་མེད་པ་དང་། ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་དམ་པ་དག་ལ་མངོན་པར་ཡིད་ཆེས་པ་དང་། དབང་ཕྱུག་དང་། རྒྱགས་པ་ལ་ཞེན་ཅིང་སྲེད་པ་མེད་པ་དང་། བཟོད་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་དང་། སྨོན་ལམ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། བསམ་པ་ཤིན་ཏུ་རྣམ་པར་དག་པར་གྱུར་པ་དང་། དགོན་པ་ན་གནས་པ་དང་། འཁོར་རྣམས་ལ་མི་རྟེན་པ་དང་། རྙེད་པ་ལ་མི་རྟེན་པ་དང་། གྲགས་པ་ལ་མི་རྟེན་པ་དང་། བསམ་གཏན་རྣམས་ལ་རབ་ཏུ་གནས་པ་དང་། འོད་ཟེར་གྱི་ཏིང་ངེ་འཛིན་རབ་ཏུ་སྟོན་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དག་ལ་སྒྱུ་མེད་པར་རིམ་གྲོ་བྱེད་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དག་ལ་མཆོག་གི་བསམ་པ་སྐྱེད་པ་དང་། ཆོས་ལ་གུས་པའི་ཕྱིར་མཁན་པོ་དང་སློབ་དཔོན་དག་ལ་ཤིན་ཏུ་བཀུར་བ་དང་། མདོ་སྡེའི་དོན་རབ་ཏུ་རྟོགས་པ་དང་། ཡང་དག་པར་བསྟན་པ་ལ་རབ་ཏུ་མཁས་པ་དང་། ཚིག་སྨྲས་པ་དག་ལ་མི་བདེན་པ་མེད་པ་དང་། ཡང་དག་པའི་བསམ་པ་ལ་གནས་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལ་བརྩོན་པ་དང་། རྟག་ཏུ་སྦྱིན་པ་གཏོང་བ་དང་། བདུད་ཀྱི་ལས་རབ་ཏུ་རྟོགས་པ་དང་། དབང་པོ་རྣམས་དམ་དུ་སྲུང་བ་དང་། ཚིག་རབ་ཏུ་བརྟགས་པ་དང་། དོན་དམ་པའི་བདེན་པ་ལ་མཁས་པ་དང་། ས་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་དང་། གཟུངས་ཟད་མི་ཤེས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། ལུས་དང་སྲོག་ལ་ཕོངས་པ་མེད་པ་དང་། འཁོར་བཞི་པོ་དག་ལ་རྗེས་སུ་སྟོན་པར་བྱེད་པ་དང་། འཇིག་རྟེན་པའི་བསམ་པ་ཡོངས་སུ་བཅད་པ་དང་། འཇིག་རྟེན་ཕྱི་མའི་ཆོས་མེད་དོ་ཞེས་ཟེར་བའི་ལོག་པར་ལྟ་བ་རྣམས་སྤངས་པ་དང་། ད་དུང་མ་བསླབས་པ་དག་ལ་གྱ་གྱུའི་མཚན་མ་མི་སྟོན་པ་དང་། གང་བསླབ་པར་འདོད་པ་དག་ལ་ཅི་ནུས་ཀྱིས་རྣམ་པར་ཕྱེ་ནས་རབ་ཏུ་སྟོན་པ་དང་། གླུ་དང་རོལ་མོའི་སྒྲ་དག་གི་བསྔགས་པ་མི་བརྗོད་པ་དང་། རྒྱན་དང་ཡོ་བྱད་ཀྱི་བསྔགས་པ་མི་བརྗོད་པ་དང་། བདེན་པ་རྣམས་ལ་ཡང་དག་པར་ཞུགས་པ་དང་། མང་དུ་ཐོས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། གཉིད་རབ་ཏུ་སྤངས་པ་དང་། ཡང་དག་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་རབ་ཏུ་བརྩོན་པ་དང་། སངས་རྒྱས་ལ་གུས་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། འཇིག་རྟེན་པའི་ལས་ཡོངས་སུ་སྤངས་པ་དང་། བསླབ་པའི་གནས་རྣམས་ལ་ཡང་དག་པར་བརྩོན་པ་དང་། ཆོས་ལ་སྲེད་པའི་ཕྱིར་གྲོགས་ཁྱད་པར་ཅན་ལ་རྟེན་པར་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་ཚོལ་བ་ལ་སྐྱོ་བ་མེད་པ་དང་། རབ་ཏུ་འབྱུང་བ་ལ་ཤིན་ཏུ་མོས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སྲུང་ཞིང་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་དང་། སྡིག་པའི་ལས་མི་སློང་བ་དང་། བསྟན་པ་རྣམས་ལ་ཐེ་ཚོམ་མེད་པ་དང་། དཔེས་སྟོན་པ་ལ་རབ་ཏུ་མཁས་པ་དང་། གསང་བ་རྣམས་རྣམ་པར་ཕྱེ་ནས་སྟོན་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཆེན་པོ་ཡོངས་སུ་ཚོལ་བ་ལ་ངལ་བ་མེད་པ་དང་། མདོ་སྡེ་ཡང་དག་པར་བཟུང་བ་རྣམས་བརྗེད་པར་མི་བྱེད་པ་དང་། རང་གི་བསླབ་པ་མི་སྤོང་བ་དང་། ཕ་རོལ་གྱི་སྨྲ་བ་རྣམས་ཚར་གཅོད་པ་དང་། ངེས་པར་འབྱུང་བའི་ལམ་ཡོངས་སུ་ཚོལ་བ་དང་། སྤྱོད་པ་ཚད་མེད་པ་རྣམས་མངོན་པར་སྒྲུབ་པ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་དེ་དག་ལ་སེམས་ངེས་པར་གྱུར་པ་དང་། རྒྱུ་དང་འབྲས་བུ་གསལ་བར་མཐོང་ཞིང་འཁོར་བའི་རྒྱུན་མི་གཅོད་པ་དང་། སྲིད་པ་གསུམ་པོ་དག་ལ་ཆགས་པ་མེད་པ་དང་། མངོན་པའི་ང་རྒྱལ་སྤངས་པ་དང་། མངོན་པར་ཡིད་ཆེས་པ་དག་ལ་གཉེན་པོ་རྣམ་པར་གཞག་པ་དག་སྟོན་པར་བྱེད་པ་དང་། མ་འོངས་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པའི་བྱེ་བྲག་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་དང་། སྔོན་གྱི་མཐའ་ཡོངས་སུ་ལེགས་པར་ཤེས་པ་དང་། གཞན་གྱི་དྲིང་ལ་མི་ལྟོས་བ་དང་། ཡོངས་སུ་སྤོང་བའི་སྤྱོད་པ་དག་ལ་བརྩོན་འགྲུས་ཀྱིས་གྲུབ་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་ཀྱི་བཀོད་པ་དག་ཕུན་སུམ་ཚོགས་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་རྣམ་པ་བརྒྱད་ཅུ་ཞེས་བྱའོ།
en: What are those eighty? (1) Protecting and recollecting sentient beings, ( ) being free of ill will, (3) guarding the purity of one’s discipline without letting it become corrupted, (4) being completely impartial, (5) being free of deceit, (6) being free of miserliness, (7) being free of envy, (8) being free of lustful thoughts, (9) being free of deceitful thoughts, (10) trusting the sacred discourses of the Great Vehicle, (11) being free of attachment and craving regarding power and arrogance, (1 ) having complete strength of patience, (13) never turning away from one’s aspirations, (14) having a completely pure motivation, (15) staying in the wilderness, (16) not associating with retinues, (17) not being thrilled about personal gains, (18) not being excited about fame, (19) dwelling firmly in the concentrations, ( 0) displaying the absorption of light rays, ( 1) sincerely revering those who observe discipline, ( ) manifesting the noblest attitude toward those who practice pure conduct, ( 3) venerating the preceptors and teachers out of respect for the Dharma, ( 4) understanding the meaning of the sūtras, ( 5) being expert in teaching, ( 6) not telling lies, ( 7) maintaining pure motivation, ( 8) exerting oneself to create roots of virtue, ( 9) constantly practicing generosity, (30) fully understanding the activities of Māra, (31) guarding one’s senses firmly, (3 ) investigating the words, (33) being expert in the ultimate truth, (34) realizing the individual characteristics of the bodhisattva levels, (35) pursuing inexhaustible form, (36) being unconcerned about one’s body and life, (37) teaching to the four retinues, (38) completely interrupting worldly concerns, (39) abandoning the wrong view that denies future existence, (40) abstaining from teaching those who are untrained and show signs of dishonesty, (41) teaching those who wish to train, to the best of one’s ability and with discernment, (4 ) not proclaiming the praises of song and music, (43) not proclaiming the praises of ornaments and provisions, (44) correctly engaging in the truths, (45) possessing excellent erudition, (46) giving up drowsiness, (47) exerting oneself in the pursuit of the genuine Dharma, (48) revering the buddhas, (49) giving rise to the mind set on awakening, (50) giving up worldly activities, (51) exerting oneself in the precepts, (5 ) relying on extraordinary friends out of thirst for the Dharma, (53) untiringly pursuing roots of virtue, (54) being highly interested in monastic ordination, (55) guarding and upholding the Dharma of the buddhas, (56) not engaging in negative actions, (57) having no doubts about the teachings, (58) being skilled in teaching through analogies, (59) revealing and disclosing secrets, (60) tirelessly pursuing great awakening, (61) not forgetting the sūtras one has received, (6 ) not giving up one’s training, (63) defeating the proponents of opposing views, (64) pursuing the path of renunciation, (65) accomplishing countless activities, (66) gaining certainty about the wisdom of the Dharma, (67) clearly perceiving the principle of causes and results, (68) continuously remaining in saṃsāra, (69) not being attached to the three realms, (70) giving up pride, (71) teaching the presentation of the antidotes to those who have strong conviction, (7 ) fully understanding the particular instances of future karmic ripening, (73) properly knowing the past limit, (74) not being dependent on others, (75) diligently accomplishing the practices of abandonment, and (76) perfecting the arrays of the buddhas’ major and minor marks—those are the eighty types of accumulation.

source: །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་བརྒྱད་ཅུ་པོ་འདི་དག་ནི་ཆོས་ལྔའི་ནང་དུ་འཇུག་པར་འགྱུར་རོ།
en: “Furthermore, Candraprabhakumāra, those eighty qualities can be included within five qualities.

source: །ཆོས་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those five?

source: འཁོར་བ་ཤེས་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཤེས་པ་དང་། ཉོན་མོངས་པ་ཟད་པ་ཤེས་པ་དང་། མཆོག་ཏུ་གྱུར་པ་ཤེས་པ་དང་། བསོད་ནམས་ཀྱི་འབྲས་བུ་ཤེས་པ་གང་ཡིན་པའོ།
en: Knowing saṃsāra, ( ) knowing nirvāṇa, (3) knowing the exhaustion of afflictions, (4) knowing what is supreme, and (5) knowing the fruition of merit.

source: །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་ལྔ་པོ་དེ་དག་ནི་ཆོས་གཉིས་ཀྱི་ནང་དུ་འཇུག་པར་འགྱུར་རོ།
en: “Candraprabhakumāra, those five qualities can further be included within two qualities.

source: །གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those two?
